app/views/posts/_form.html.erb

  <%= f.text_area :content %> <br>
  <%= f.collection_check_boxes :category_ids, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"