app/views/posts/_post.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 3]]
---
  <%= @post.content %>
  <% @post.categories.each do |category| %>