app/controllers/posts_controller.rb

  def create
    binding.pry
    post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New Post"], ["content", "Some new content"], ["created_at", "2016-01-15 21:00:20.073324"], ["updated_at", "2016-01-15 21:00:20.073324"]]